dhzl84/ESP8266-Smart-Home/src/main.cpp
/*===================================================================================================================*/
/* includes */
/*===================================================================================================================*/
#include "main.h"
#include "version.h"

#include <ESP8266WiFi.h>

#include <DHTesp.h>
#include "cThermostat.h"
#include <osapi.h>   /* for sensor timer */
#include <os_type.h> /* for sensor timer */

#include "cSystemState.h"

#include "UserFonts.h"
#include <SSD1306.h>

#if CFG_MQTT_CLIENT
#include "MQTTClient.h"
#include "cMQTT.h"
#endif /* CFG_MQTT_CLIENT */
#if CFG_HTTP_UPDATE
#include <ESP8266httpUpdate.h>
#endif
#if CFG_OTA
#include <ArduinoOTA.h>
#endif
#if CFG_SPIFFS
#include <FS.h>
#endif

/*===================================================================================================================*/
/* GPIO config */
/*===================================================================================================================*/
#define DHT_PIN              2 /* sensor */
#define SDA_PIN              4 /* I²C */
#define SCL_PIN              5 /* I²C */
#define ENCODER_PIN1        12 /* rotary left/right */
#define ENCODER_PIN2        13 /* rotary left/right */
#define ENCODER_SWITCH_PIN  14 /* push button switch */
#define RELAY_PIN           16 /* relay control */

/*===================================================================================================================*/
/* variables, constants, types, classes, etc, definitions */
/*===================================================================================================================*/
/* WiFi */
const char* ssid     = WIFI_SSID;
const char* password = WIFI_PWD;

#if CFG_MQTT_CLIENT
const char*    mqttHost                = LOCAL_MQTT_HOST;
const int      mqttPort                = 1883;
unsigned long  MQTT_RECONNECT_REFERENCE_TIME;
boolean        MQTT_RECONNECT          = false;
#endif

#if CFG_HTTP_UPDATE
const String myUpdateServer = THERMOSTAT_BINARY;
boolean                 FETCH_UPDATE                    = false;       /* global variable used to decide whether an update shall be fetched from server or not */
#endif /* CFG_HTTP_UPDATE */

#if CFG_OTA
boolean                 OTA_UPDATE                      = false;       /* global variable used to change display in case OTA update is initiated */
#endif /* CFG_OTA */

#if CFG_ROTARY_ENCODER
#define switchDebounceTime  250
#define rotLeft              -1
#define rotRight              1
#define rotInit               0
#define tempStep              5
#define displayTemp           0
#define displayHumid          1
volatile unsigned long  SWITCH_DEBOUNCE_REF             = 0;           /* reference for debouncing the rotary encoder button switch, latches return of millis() to be checked in next switch interrupt */
volatile int            LAST_ENCODED                    = 0b11;        /* initial state of the rotary encoders gray code */
volatile int            ROTARY_ENCODER_DIRECTION_INTS   = rotInit;     /* initialize rotary encoder with no direction */
#endif


unsigned long read_sensor_scheduled = 0;
unsigned long read_sensor_schedule_time = 20000;       // 20 s in ms
DHTesp myDHT;

Thermostat myThermostat;

#if CFG_DISPLAY
#define drawTempYOffset       16
#define drawTargetTempYOffset 0
#define drawHeating drawXbm(0,drawTempYOffset,myThermo_width,myThermo_height,myThermo)
SSD1306        myDisplay(0x3c,SDA_PIN,SCL_PIN);
#endif

#if CFG_MQTT_CLIENT
#define MQTT_MAIN_TOPIC "/heating/"
#endif /* CFG_MQTT_CLIENT */

WiFiClient     myWiFiClient;
SystemState    mySystemState;

#if CFG_MQTT_CLIENT
MQTTClient     myMqttClient;
mqttConfig     myMqttConfig;
#endif

#if CFG_SPIFFS
#if CFG_MQTT_CLIENT
#define        SPIFFS_MQTT_ID_FILE        String("/itsme")
#endif
#if CFG_SENSOR
#define        SPIFFS_SENSOR_CALIB_FILE   String("/sensor")
#endif
#if CFG_HEATING_CONTROL
#define        SPIFFS_TARGET_TEMP_FILE    String("/targetTemp")
#define        SPIFFS_WRITE_DEBOUNCE      20000 /* write target temperature to spiffs if it wasn't changed for 20 s (time in ms) */
boolean        SPIFFS_WRITTEN =           true;
unsigned long  SPIFFS_REFERENCE_TIME;
int            SPIFFS_LAST_TARGET_TEMPERATURE;
#endif /* CFG_HEATING_CONTROL */
#endif /* CFG_SPIFFS */

/*===================================================================================================================*/
/* function declarations */
/*===================================================================================================================*/
void GPIO_CONFIG(void);

#if CFG_SPIFFS
void SPIFFS_INIT(void);
void SPIFFS_MAIN(void);
#endif

#if CFG_DISPLAY
void DISPLAY_INIT(void);
#endif

void WIFI_CONNECT(void);

void HANDLE_SYSTEM_STATE(void);

#if CFG_SENSOR
void SENSOR_MAIN(void);
LOCAL void sensor_cb(void *arg); /* sensor timer callback */
#endif

#if CFG_HEATING_CONTROL
void HEATING_CONTROL_MAIN(void);
#endif

#if CFG_DISPLAY
void DRAW_DISPLAY_MAIN(void);
#endif

#if CFG_MQTT_CLIENT
void MQTT_CONNECT(void);
void MQTT_MAIN(void);
void messageReceived(String &topic, String &payload); /* MQTT callback */
#endif

#if CFG_OTA
void OTA_INIT(void);
void HANDLE_OTA_UPDATE(void);
#endif

#if CFG_HTTP_UPDATE
void HANDLE_HTTP_UPDATE(void);
#endif
#if CFG_ROTARY_ENCODER
void encoderSwitch (void);
void updateEncoder(void);
#endif

/*===================================================================================================================*/
/* library functions */
/*===================================================================================================================*/
long TimeDifference(unsigned long prev, unsigned long next)
{
  // Return the time difference as a signed value, taking into account the timers may overflow.
  // Returned timediff is between -24.9 days and +24.9 days.
  // Returned value is positive when "next" is after "prev"
  long signed_diff = 0;
  // To cast a value to a signed long, the difference may not exceed half 0xffffffffUL (= 4294967294)
  const unsigned long half_max_unsigned_long = 2147483647u;  // = 2^31 -1
  if (next >= prev) {
    const unsigned long diff = next - prev;
    if (diff <= half_max_unsigned_long) {                    // Normal situation, just return the difference.
      signed_diff = static_cast<long>(diff);                 // Difference is a positive value.
    } else {
      // prev has overflow, return a negative difference value
      signed_diff = static_cast<long>((0xffffffffUL - next) + prev + 1u);
      signed_diff = -1 * signed_diff;
    }
  } else {
    // next < prev
    const unsigned long diff = prev - next;
    if (diff <= half_max_unsigned_long) {                    // Normal situation, return a negative difference value
      signed_diff = static_cast<long>(diff);
      signed_diff = -1 * signed_diff;
    } else {
      // next has overflow, return a positive difference value
      signed_diff = static_cast<long>((0xffffffffUL - prev) + next + 1u);
    }
  }
  return signed_diff;
}

