dhzl84/ESP8266-Smart-Home/src/main.cpp
long TimePassedSince(unsigned long timestamp)
{
  // Compute the number of milliSeconds passed since timestamp given.
  // Note: value can be negative if the timestamp has not yet been reached.
  return TimeDifference(timestamp, millis());
}

bool TimeReached(unsigned long timer)
{
  // Check if a certain timeout has been reached.
  const long passed = TimePassedSince(timer);
  return (passed >= 0);
}

void SetNextTimeInterval(unsigned long& timer, const unsigned long step)
{
  timer += step;
  const long passed = TimePassedSince(timer);
  if (passed < 0) { return; }   // Event has not yet happened, which is fine.
  if (static_cast<unsigned long>(passed) > step) {
    // No need to keep running behind, start again.
    timer = millis() + step;
    return;
  }
  // Try to get in sync again.
  timer = millis() + (step - passed);
}

boolean debounceCheck()
{
   boolean ret = false;

   unsigned long time = millis();
   if ((time - SWITCH_DEBOUNCE_REF) > switchDebounceTime)
   {
      SWITCH_DEBOUNCE_REF = time;
      ret = true;
   }
   else
   {
      ret = false;
   }

   return ret;
}

float intToFloat(int intValue)
{
   return ((float)(intValue/10.0));
}

int floatToInt(float floatValue)
{
   return ((int)(floatValue * 10));
}

String boolToStringOnOff(bool boolean)
{
   if (boolean == true)
   {
      return "on";
   }
   else
   {
      return "off";
   }
}

String boolToStringHeatOff(bool boolean)
{
   if (boolean == true)
   {
      return "heat";
   }
   else
   {
      return "off";
   }
}

#if CFG_SPIFFS
String readSpiffs(String file)
{
   String fileContent = "";

   if (SPIFFS.exists(file))
   {
      File f = SPIFFS.open(file, "r");
      if (!f) {
         Serial.println("oh no, failed to open file: "+ file);
         /* TODO: Error handling */
      }
      else
      {
         fileContent = f.readStringUntil('\n');
         f.close();

         if (fileContent == "")
         {
            Serial.println("File " + file + " is empty");
         }
      }
   }
   else
   {
      Serial.println("File " + file + " does not exist");
   }
   return fileContent;
}

boolean writeSpiffs(String file, String newFileContent)
{
   boolean success = false; /* return success = true if no error occured and the newFileContent equals the file content */
   String  currentFileContent = "";

   if (SPIFFS.exists(file))
   {
      #ifdef CFG_DEBUG
      File f = SPIFFS.open(file, "r");
      currentFileContent = f.readStringUntil('\n');
      f.close();
      #endif
   }

   if (currentFileContent == newFileContent)
   {
      success = true; /* nothing to do, consider write as successful */

      #ifdef CFG_DEBUG
      Serial.println("Content of '" + file + "' before writing: " + currentFileContent + " equals new content: " + newFileContent + ". Nothing to do");
      #endif
   }
   else
   {
      #ifdef CFG_DEBUG
      Serial.println("Content of '" + file + "' before writing: " + currentFileContent);
      #endif

      SPIFFS.remove(file);

      File f = SPIFFS.open(file, "w");
      if (!f)
      {
         #ifdef CFG_DEBUG
         Serial.println("Failed to open file: " + file + " for writing");
         #endif /* CFG_DEBUG */

         /* TODO: Error handling */
      }
      else
      {
         #ifdef CFG_DEBUG
         Serial.println("New content of '" + file + "' is: " + newFileContent);
         #endif /* CFG_DEBUG */

         f.print(newFileContent);
         f.close();
         success = true; /* new content written */
         delay(1000);
      }
   }
   return success;
}

#endif /* CFG_SPIFFS */

#if CFG_SENSOR
bool splitSensorDataString(String sensorCalib, int *offset, int *factor)
{
   bool ret = false;
   String delimiter = ";";
   size_t pos = 0;

   pos = (sensorCalib.indexOf(delimiter));

   /* don't accept empty substring or strings without delimiter */
   if ((pos > 0) && (pos < UINT32_MAX))
   {
      ret = true;
      *offset = (sensorCalib.substring(0, pos)).toInt();
      *factor = (sensorCalib.substring(pos+1)).toInt();
   }
   #ifdef CFG_DEBUG
   else
   {
      Serial.println("Malformed sensor calibration string >> calibration update denied");
   }

   Serial.println("Delimiter: " + delimiter);
   Serial.println("Position of delimiter: " + String(pos));
   Serial.println("Offset: " + String(*offset));
   Serial.println("Factor: " + String(*factor));
   #endif
   return ret;
}
#endif
/*===================================================================================================================*/
/* The setup function is called once at startup of the sketch */
/*===================================================================================================================*/
void setup()
{
   Serial.begin(115200);
   delay(1000);
   #ifdef CFG_DEBUG
   Serial.println("Serial connection established");
   #endif

   #if CFG_SPIFFS
   SPIFFS_INIT();   /* read stuff from SPIFFS */
   #endif

   GPIO_CONFIG();    /* configure GPIOs */

   #if CFG_SENSOR
   myDHT.setup(DHT_PIN, DHTesp::DHT22);    /* init DHT sensor */
   #endif

   #if CFG_DISPLAY
   DISPLAY_INIT();   /* init Display */
   #endif

   WIFI_CONNECT();   /* connect to WiFi */

   #if CFG_OTA
   OTA_INIT();
   #endif

   #if CFG_MQTT_CLIENT
   myMqttConfig.setup(MQTT_MAIN_TOPIC);
   MQTT_CONNECT();   /* connect to MQTT host and build subscriptions, must be called after SPIFFS_INIT()*/
   #endif

   #if CFG_ROTARY_ENCODER
   /* enable interrupts on encoder pins to decode gray code and recognize switch event*/
   attachInterrupt(ENCODER_PIN1, updateEncoder, CHANGE);
   attachInterrupt(ENCODER_PIN2, updateEncoder, CHANGE);
   attachInterrupt(ENCODER_SWITCH_PIN, encoderSwitch, FALLING);
   #endif
}

/*===================================================================================================================*/
/* functions called by setup() */
/*===================================================================================================================*/
#if CFG_SPIFFS
void SPIFFS_INIT(void)
{
   SPIFFS.begin();

   if (!SPIFFS.exists("/formatted"))
   {
      /* This code is only run once to format the SPIFFS before first usage */
      #ifdef CFG_DEBUG
      Serial.println("Formatting SPIFFS, this takes some time");
      #endif
      SPIFFS.format();
      #ifdef CFG_DEBUG
      Serial.println("Formatting SPIFFS finished");
      Serial.println("Open file '/formatted' in write mode");
      #endif
      File f = SPIFFS.open("/formatted", "w");
      if (!f) {
          Serial.println("file open failed");
      }
      else
      {
         f.close();
         delay(5000);
         if (!SPIFFS.exists("/formatted"))
         {
            Serial.println("That didn't work!");
         }
         else
         {
            #ifdef CFG_DEBUG
            Serial.println("Cool, working!");
            #endif
         }
      }
   }
   else
   {
      #ifdef CFG_DEBUG
      Serial.println("Found '/formatted' >> SPIFFS ready to use");
      #endif
   }
   #ifdef CFG_DEBUG
   Serial.println("Check if I remember who I am ... ");
   #endif


   #ifdef CFG_DEBUG
   Dir dir = SPIFFS.openDir("/");
   while (dir.next()) {
       Serial.print("SPIFFS file found: " + dir.fileName() + " - Size in byte: ");
       File f = dir.openFile("r");
       Serial.println(f.size());
   }
   #endif

   #if CFG_MQTT_CLIENT
   /* check name for MQTT */

