dhzl84/ESP8266-Smart-Home/src/main.cpp
      #if CFG_SENSOR
      ret = myMqttClient.subscribe(myMqttConfig.getTopicChangeSensorCalib());
      #ifdef CFG_DEBUG
      Serial.print("MQTT subscribe " + myMqttConfig.getTopicChangeSensorCalib() + ": ");
      (ret == true) ? (Serial.println("success")) : (Serial.println("failed"));
      #endif
      #endif /* CFG_SENSOR */

      ret = myMqttClient.subscribe(myMqttConfig.getTopicSystemRestartRequest());
      #ifdef CFG_DEBUG
      Serial.print("MQTT subscribe " + myMqttConfig.getTopicSystemRestartRequest() + ": ");
      (ret == true) ? (Serial.println("success")) : (Serial.println("failed"));
      #endif

      /* publish online on connect */
      myMqttClient.publish(myMqttConfig.getTopicState(),"online", true, 1);
      #ifdef CFG_DEBUG
      Serial.println("MQTT publish " + myMqttConfig.getTopicState() + ": online");
      #endif

      /* publish restart = false on connect */
      myMqttClient.publish(myMqttConfig.getTopicSystemRestartRequest(),"0", true, 1);
      #ifdef CFG_DEBUG
      Serial.println("MQTT publish " + myMqttConfig.getTopicSystemRestartRequest() + ": 0");
      #endif

      /* publish firmware version on connect */
      myMqttClient.publish(myMqttConfig.getTopicFirmwareVersion(), FIRMWARE_VERSION, true, 1);
      #ifdef CFG_DEBUG
      Serial.println("MQTT publish " + myMqttConfig.getTopicFirmwareVersion() + ": " + FIRMWARE_VERSION);
      #endif

      delete [] mqttWillTopic;
      delete [] mqttName;
   }
}
#endif
/*===================================================================================================================*/
/* The loop function is called in an endless loop */
/*===================================================================================================================*/
void loop()
{
   HANDLE_SYSTEM_STATE(); /*handle system state class and trigger reconnects */

   #if CFG_SENSOR
   SENSOR_MAIN();   /* get sensor data */
   #endif

   #if CFG_HEATING_CONTROL
   HEATING_CONTROL_MAIN(); /* control relay for heating */
   #endif

   #if CFG_MQTT_CLIENT
   MQTT_MAIN(); /* handle MQTT each loop */
   #endif

   #if CFG_DISPLAY
   DRAW_DISPLAY_MAIN(); /* draw display each loop */
   #endif

   #if CFG_HTTP_UPDATE
   HANDLE_HTTP_UPDATE(); /* pull update from server if it was requested via MQTT*/
   #endif

   #if CFG_OTA
   HANDLE_OTA_UPDATE();
   #endif

   #if CFG_SPIFFS
   SPIFFS_MAIN();
   #endif

   yield();
}

/*===================================================================================================================*/
/* functions called by loop() */
/*===================================================================================================================*/
void HANDLE_SYSTEM_STATE(void)
{
   if (mySystemState.getSystemRestartRequest() == true)
   {
      #if CFG_DISPLAY
      DRAW_DISPLAY_MAIN();
      #endif /* CFG_DISPLAY */

      Serial.println("Restarting in 3 seconds");
      delay(3000);
      ESP.restart();
   }

   if (WiFi.status() == WL_CONNECTED)
   {
      if (mySystemState.getSystemState() == systemState_offline)
      {
         mySystemState.setSystemState(systemState_online);
      }
   }
   else
   {
      if (mySystemState.getSystemState() == systemState_online)
      {
         mySystemState.setSystemState(systemState_offline);
      }
   }

   if (systemState_offline == mySystemState.getSystemState())
   {
      if (mySystemState.getConnectDebounceTimer() == 0) /* getConnectDebounceTimer decrements the timer */
      {
         /* try to come online, debounced to avoid reconnect each loop*/
         WIFI_CONNECT();

         #if CFG_MQTT_CLIENT
         MQTT_CONNECT();
         #endif

         #if CFG_OTA
         OTA_INIT();
         #endif
      }
   }
}

#if CFG_SENSOR
void SENSOR_MAIN()
{
   float dhtTemp;
   float dhtHumid;

   /* dschedule routine for sensor read */
   if (TimeReached(read_sensor_scheduled))
   {
      SetNextTimeInterval(read_sensor_scheduled, read_sensor_schedule_time);

      /* Reading temperature or humidity takes about 250 milliseconds! */
      /* Sensor readings may also be up to 2 seconds 'old' (its a very slow sensor) */
      dhtHumid = myDHT.getHumidity();
      dhtTemp  = myDHT.getTemperature();

      /* Check if any reads failed */
      if (isnan(dhtHumid) || isnan(dhtTemp)) {
         myThermostat.setLastSensorReadFailed(true);   /* set failure flag and exit SENSOR_MAIN() */
         #ifdef CFG_DEBUG
         Serial.println("Failed to read from DHT sensor! Failure counter: " + String(myThermostat.getSensorFailureCounter()));
         #endif
      }
      else
      {
         myThermostat.setLastSensorReadFailed(false);   /* set no failure during read sensor */

         myThermostat.setCurrentHumidity((int)(10* dhtHumid));     /* read value and convert to one decimal precision integer */
         myThermostat.setCurrentTemperature((int)(10* dhtTemp));   /* read value and convert to one decimal precision integer */

         #ifdef CFG_DEBUG
         Serial.print("Temperature: ");
         Serial.print(intToFloat(myThermostat.getCurrentTemperature()),1);
         Serial.println(" *C ");
         Serial.print("Filtered temperature: ");
         Serial.print(intToFloat(myThermostat.getFilteredTemperature()),1);
         Serial.println(" *C ");

         Serial.print("Humidity: ");
         Serial.print(intToFloat(myThermostat.getCurrentHumidity()),1);
         Serial.println(" %");
         Serial.print("Filtered humidity: ");
         Serial.print(intToFloat(myThermostat.getFilteredHumidity()),1);
         Serial.println(" %");
         #endif

         #ifdef CFG_PRINT_TEMPERATURE_QUEUE
         for (int i = 0; i < CFG_MEDIAN_QUEUE_SIZE; i++)
         {
            int temperature;
            int humidity;
            if ( (myTemperatureFilter.getRawSampleValue(i,&temperature)) && (myHumidityFilter.getRawSampleValue(i,&humidity)))
            {
               Serial.print("Sample ");
               Serial.print(i);
               Serial.print(": ");
               Serial.print(intToFloat(temperature),1);
               Serial.print(", ");
               Serial.println(intToFloat(humidity),1);
            }
         }
         #endif
      }
   }
}
#endif

#if CFG_HEATING_CONTROL
void HEATING_CONTROL_MAIN(void)
{
   #if CFG_SENSOR
   if (myThermostat.getSensorError())
   {
      /* switch off heating if sensor does not provide values */
      #ifdef CFG_DEBUG
      Serial.println("not heating, sensor data invalid");
      #endif
      if (myThermostat.getHeatingEnabled() == true)
      {
         myThermostat.setHeatingEnabled(false);
      }
   }
   else /* sensor is healthy */
   {
      if (myThermostat.getHeatingAllowed() == true) /* check if heating is allowed by user */
      {
         if (myThermostat.getFilteredTemperature() < myThermostat.getTargetTemperature()) /* check if measured temperature is lower than heating target */
         {
            if (myThermostat.getHeatingEnabled() == false) /* switch on heating if target temperature is higher than measured temperature */
            {
               #ifdef CFG_DEBUG
               Serial.println("heating");
               #endif
               myThermostat.setHeatingEnabled(true);
            }
         }
         else if (myThermostat.getFilteredTemperature() > myThermostat.getTargetTemperature()) /* check if measured temperature is higher than heating target */
         {
            if (myThermostat.getHeatingEnabled() == true) /* switch off heating if target temperature is lower than measured temperature */
            {
               #ifdef CFG_DEBUG
               Serial.println("not heating");
               #endif
               myThermostat.setHeatingEnabled(false);
            }
         }
         else
         {
            /* remain in current heating state if temperatures are equal */
         }
      }
      else
      {
         /* disable heating if heating is set to not allowed by user */
         myThermostat.setHeatingEnabled(false);
      }
   }
   #endif /* CFG_SENSOR */
}
#endif

