dhzl84/ESP8266-Smart-Home/src/main.cpp
#if CFG_DISPLAY
void DRAW_DISPLAY_MAIN(void)
{
   myDisplay.clear();

   myDisplay.setContrast(50);

   if (mySystemState.getSystemRestartRequest() == true)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      myDisplay.drawString(64,22,"Restart");
   }
   #if CFG_OTA
   else if (OTA_UPDATE == true)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      myDisplay.drawString(64,22,"Update");
   }
   #endif /* CFG_OTA */
   #if CFG_HTTP_UPDATE
   else if (FETCH_UPDATE == true)
   {
      myDisplay.setFont(Roboto_Condensed_16);
      myDisplay.setTextAlignment(TEXT_ALIGN_CENTER);
      myDisplay.drawString(64,22,"Update");
   }
   #endif /* CFG_HTTP_UPDATE */
   else
   {
      myDisplay.setTextAlignment(TEXT_ALIGN_RIGHT);
      myDisplay.setFont(Roboto_Condensed_32);

      #if CFG_SENSOR
      if (myThermostat.getSensorError())
      {
         myDisplay.drawString(128, drawTempYOffset, "err");
      }
      else
      {
         myDisplay.drawString(128, drawTempYOffset, String(intToFloat(myThermostat.getFilteredTemperature()),1));
      }
      #endif /* CFG_SENSOR */

      #if CFG_HEATING_CONTROL
      /* do not display target temperature if heating is not allowed */
      if (myThermostat.getHeatingAllowed() == true)
      {
         myDisplay.setFont(Roboto_Condensed_16);
         myDisplay.drawString(128, drawTargetTempYOffset, String(intToFloat(myThermostat.getTargetTemperature()),1));

         if (myThermostat.getHeatingEnabled()) /* heating */
         {
            myDisplay.drawHeating;
         }
      }
      #endif /* CFG_HEATING_CONTROL */
   }
   #ifdef CFG_DEBUG
   myDisplay.setTextAlignment(TEXT_ALIGN_LEFT);
   myDisplay.setFont(Roboto_Condensed_16);
   myDisplay.drawString(0, drawTargetTempYOffset, String(VERSION));
   #endif

   myDisplay.display();
}
#endif

#if CFG_MQTT_CLIENT
void MQTT_MAIN(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      if(!myMqttClient.connected())
      {
         if (MQTT_RECONNECT == false)
         {
            MQTT_RECONNECT = true;
            MQTT_RECONNECT_REFERENCE_TIME = millis();
         }
         else  /* try reconnect to MQTT broker after MQTT_RECONNECT_TIME expired */
         {
            if (MQTT_RECONNECT_REFERENCE_TIME + MQTT_RECONNECT_TIME < millis())
            {
               MQTT_RECONNECT = false;
               MQTT_CONNECT();
            }
            else
            {
               /* debounce reconnect */
               #ifdef CFG_DEBUG
               if ( (MQTT_RECONNECT_REFERENCE_TIME + MQTT_RECONNECT_TIME - millis()) % 100 == 0 )
               {
                  Serial.println("MQTT reconnect in: " + String((MQTT_RECONNECT_REFERENCE_TIME + MQTT_RECONNECT_TIME - millis())));
               }
               #endif
            }
         }

         return; /* no MQTT connection */
      }
      else
      {
          MQTT_RECONNECT = false; /* reset */
      }

      #if CFG_HTTP_UPDATE
      if (FETCH_UPDATE == true)
      {
         myMqttClient.publish(myMqttConfig.getTopicUpdateFirmwareAccepted(), String(false)); /* publish accepted update with value false to reset the switch in Home Assistant */
      }
      #endif /* CFG_HTTP_UPDATE */

      /* check if there is new data to transmit */
      if (myThermostat.getNewData())
      {
         myThermostat.resetNewData();
         myMqttClient.publish(myMqttConfig.getTopicTemp()               ,String(intToFloat(myThermostat.getFilteredTemperature()))        ,true, 1); /* publish filtered temperature */
         myMqttClient.publish(myMqttConfig.getTopicHum()                ,String(myThermostat.getFilteredHumidity())                       ,true, 1); /* publish filtered humidity */
         myMqttClient.publish(myMqttConfig.getTopicHeatingState()       ,String(boolToStringOnOff(myThermostat.getHeatingEnabled()))  ,true, 1); /* publish heating state: 0 -> heating off, 1 -> heating on */
         myMqttClient.publish(myMqttConfig.getTopicTargetTempState()    ,String(intToFloat(myThermostat.getTargetTemperature()))      ,true, 1); /* publish target temperature as float */
         myMqttClient.publish(myMqttConfig.getTopicSensorStatus()       ,String(myThermostat.getSensorError())                            ,true, 1); /* publish sensor status: 0 -> good, 1 -> error */
         myMqttClient.publish(myMqttConfig.getTopicHeatingAllowedState(),String(boolToStringHeatOff(myThermostat.getHeatingAllowed()))  ,true, 1); /* publish if heating is allowed */
         myMqttClient.publish(myMqttConfig.getTopicSensorCalibFactor()  ,String(myThermostat.getSensorCalibFactor())                      ,true, 1); /* publish calibration factor */
         myMqttClient.publish(myMqttConfig.getTopicSensorCalibOffset()  ,String(myThermostat.getSensorCalibOffset())                      ,true, 1); /* publish calibration offset */
         myMqttClient.publish(myMqttConfig.getTopicDeviceIP()           ,WiFi.localIP().toString()                                        ,true, 1); /* publish device IP address */
      }

      myMqttClient.loop();
      delay(20); // <- fixes some issues with WiFi stability
   }
}
#endif

#if CFG_HTTP_UPDATE
void HANDLE_HTTP_UPDATE(void)
{
   if (FETCH_UPDATE == true)
   {
      #if CFG_DISPLAY
      DRAW_DISPLAY_MAIN();
      #endif

      FETCH_UPDATE = false;
      Serial.printf("Remote update started");

      t_httpUpdate_return ret = ESPhttpUpdate.update(myUpdateServer);

      switch(ret) {
          case HTTP_UPDATE_FAILED:
              Serial.printf("HTTP_UPDATE_FAILD Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
              break;

          case HTTP_UPDATE_NO_UPDATES:
             Serial.println("HTTP_UPDATE_NO_UPDATES");
              break;

          case HTTP_UPDATE_OK:
             Serial.println("HTTP_UPDATE_OK");
              break;
      }
   }
}
#endif

#if CFG_OTA
void HANDLE_OTA_UPDATE(void)
{
   if (systemState_online == mySystemState.getSystemState())
   {
      ArduinoOTA.handle();
   }
}
#endif
#if CFG_SPIFFS
void SPIFFS_MAIN(void)
{
   #if CFG_MQTT_CLIENT
   if (myMqttConfig.getNameChanged())
   {
      mySystemState.setSystemRestartRequest(true);

      if (!writeSpiffs(SPIFFS_MQTT_ID_FILE, myMqttConfig.getName()))
      {
         #ifdef CFG_DEBUG
         Serial.println("Writing to file: " + SPIFFS_MQTT_ID_FILE + " returned no success");
         #endif
         /* ToDo: implement retry */
      }
   }

