dhzl84/ESP8266-Smart-Home/src/main.cpp
   #if CFG_SENSOR
   if(myThermostat.getNewCalib())
   {
      mySystemState.setSystemRestartRequest(true);

      if (!writeSpiffs(SPIFFS_SENSOR_CALIB_FILE, String(myThermostat.getSensorCalibOffset()) + ";" + String(myThermostat.getSensorCalibFactor())))
      {
         #ifdef CFG_DEBUG
         Serial.println("Writing to file: " + SPIFFS_SENSOR_CALIB_FILE + " returned no success");
         #endif
         /* ToDo: implement retry */
      }

   }
   #endif /* CFG_SENSOR */
   #endif /* CFG_MQTT_CLIENT */

   #if CFG_HEATING_CONTROL
   /* avoid extensive writing to SPIFFS, therefore check if the target temperature didn't change for a certain time before writing. */
   if (myThermostat.getTargetTemperature() != SPIFFS_LAST_TARGET_TEMPERATURE)
   {
      #ifdef CFG_DEBUG
      Serial.println("Target temperature changed from. " + String(SPIFFS_LAST_TARGET_TEMPERATURE) + " to: " + String(myThermostat.getTargetTemperature()));
      #endif

      SPIFFS_REFERENCE_TIME = millis();
      SPIFFS_LAST_TARGET_TEMPERATURE = myThermostat.getTargetTemperature();
      SPIFFS_WRITTEN = false;
   }
   else /* target temperature not changed this loop */
   {
      if (SPIFFS_WRITTEN == true)
      {
         /* do nothing, last change was already stored in SPIFFS */
      }
      else /* latest change not stored in SPIFFS */
      {
         if (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE < millis()) /* check debounce */
         {
            /* debounce expired -> write */
            if (writeSpiffs(SPIFFS_TARGET_TEMP_FILE, String(myThermostat.getTargetTemperature())))
            {
               SPIFFS_WRITTEN = true;
            }
            else
            {
               #ifdef CFG_DEBUG
               Serial.println("Writing to file: " + SPIFFS_TARGET_TEMP_FILE + " returned no success, retry next loop");
               #endif
            }

            #ifdef CFG_DEBUG
            Serial.println("New target temperature: " + String(myThermostat.getTargetTemperature()) + " stored in SPIFFS");
            #endif
         }
         else
         {
            /* debounce SPIFFS write */
            #ifdef CFG_DEBUG
            if ( (SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE - millis()) % 100 == 0 ) /* modulo 100 to avoid excessive prints while debouncing */
            {
               Serial.println("Debouncing at: " + String((SPIFFS_REFERENCE_TIME + SPIFFS_WRITE_DEBOUNCE - millis())));
            }
            #endif
         }
      }
   }
   #endif /* CFG_HEATING_CONTROL */
}
#endif /* CFG_SPIFFS */
/*===================================================================================================================*/
/* callback, interrupt, timer functions */
/*===================================================================================================================*/



#if CFG_ROTARY_ENCODER
void ICACHE_RAM_ATTR encoderSwitch(void)
{
   /* debouncing routine for encoder switch */
   if (debounceCheck())
   {
      #if CFG_HEATING_CONTROL
      /* toggle heating allowed */
      myThermostat.toggleHeatingAllowed();
      #endif
   }
}

void ICACHE_RAM_ATTR updateEncoder(void)
{
   int MSB = digitalRead(ENCODER_PIN1);
   int LSB = digitalRead(ENCODER_PIN2);

   int encoded = (MSB << 1) |LSB;  /* converting the 2 pin value to single number */

   int sum  = (LAST_ENCODED << 2) | encoded; /* adding it to the previous encoded value */

   if(sum == 0b1101 || sum == 0b0100 || sum == 0b0010 || sum == 0b1011) /* gray patterns for rotation to right */
   {
      ROTARY_ENCODER_DIRECTION_INTS += rotRight; /* count rotation interrupts to left and right, this shall make the encoder routine more robust against bouncing */
   }
   if(sum == 0b1110 || sum == 0b0111 || sum == 0b0001 || sum == 0b1000)  /* gray patterns for rotation to left */
   {
      ROTARY_ENCODER_DIRECTION_INTS += rotLeft;
   }

   if (encoded == 0b11) /* if the encoder is in an end position, evaluate the number of interrupts to left/right. simple majority wins */
   {
      #ifdef CFG_DEBUG
      Serial.println("Rotary encoder interrupts: " + String(ROTARY_ENCODER_DIRECTION_INTS));
      #endif

      if(ROTARY_ENCODER_DIRECTION_INTS > rotRight) /* if there was a higher amount of interrupts to the right, consider the encoder was turned to the right */
      {
         #if CFG_HEATING_CONTROL
         myThermostat.increaseTargetTemperature(tempStep);
         #endif /* CFG_HEATING_CONTROL */
      }
      else if (ROTARY_ENCODER_DIRECTION_INTS < rotLeft) /* if there was a higher amount of interrupts to the left, consider the encoder was turned to the left */
      {
         #if CFG_HEATING_CONTROL
         myThermostat.decreaseTargetTemperature(tempStep);
         #endif /* CFG_HEATING_CONTROL */
      }
      else
      {
         /* do nothing here, left/right interrupts have occurred with same amount -> should never happen */
      }
      ROTARY_ENCODER_DIRECTION_INTS = rotInit; /* reset interrupt count for next sequence */
   }

   LAST_ENCODED = encoded; /* store this value for next time */
}
#endif

#if CFG_MQTT_CLIENT
void messageReceived(String &topic, String &payload)
{
   #ifdef CFG_DEBUG
   Serial.println("received: " + topic + " : " + payload);
   #endif

   if (topic == myMqttConfig.getTopicSystemRestartRequest())
   {
      #ifdef CFG_DEBUG
      Serial.println("Restart request received with value: " + payload);
      Serial.println("Parameter passed to Restart class: " + String((bool)(payload.toInt() & 1)));
      #endif

      mySystemState.setSystemRestartRequest((bool)(payload.toInt() & 1)); /* extract boolean from payload string */
   }

   #if CFG_HTTP_UPDATE
   if (topic == myMqttConfig.getTopicUpdateFirmware())
   {
      if (payload == "true")
      {
         #ifdef CFG_DEBUG
         Serial.println("Firmware updated triggered via MQTT");
         #endif
         FETCH_UPDATE = true;
      }
      else
      {
         FETCH_UPDATE = false;
      }
   }
   #endif /* CFG_HTTP_UPDATE */

   #if CFG_HEATING_CONTROL
   /* check incoming target temperature, don't set same target temperature as new*/
   if (topic == myMqttConfig.getTopicTargetTempCmd())
   {
      if (myThermostat.getTargetTemperature() != payload.toFloat())
      {
         /* set new target temperature for heating control, min/max limitation inside (string to float to int) */
         myThermostat.setTargetTemperature(floatToInt(payload.toFloat()));
      }
   }
   if (topic == myMqttConfig.getTopicHeatingAllowedCmd())
   {
      if (String("heat") == payload)
      {
         myThermostat.setHeatingAllowed(true);
      }
      else if (String("off") == payload)
      {
         myThermostat.setHeatingAllowed(false);
      }
      else
      {
          /* do nothing */
      }
   }
   #endif

   #if CFG_SPIFFS
   if (topic == myMqttConfig.getTopicChangeName())
   {
      #ifdef CFG_DEBUG
      Serial.println("New name received: " + payload);
      #endif
      if (payload != myMqttConfig.getName())
      {
         #ifdef CFG_DEBUG
         Serial.println("Old name was: " + myMqttConfig.getName());
         #endif
         myMqttConfig.changeName(payload);
      }
   }

   #if CFG_SENSOR
   if(topic == myMqttConfig.getTopicChangeSensorCalib())
   {
      #ifdef CFG_DEBUG
      Serial.println("New sensor calibration parameters received: " + payload);
      #endif

      int offset;
      int factor;

      if (splitSensorDataString(payload, &offset, &factor))
      {
         myThermostat.setSensorCalibData(offset, factor, true);
      }
   }
   #endif /* CFG_SENSOR */
   #endif /* CFG_SPIFFS */
}
#endif
